Repository: m23project/mdk-devel
Catalog: mdk/m23helper/kudzu-1.2.57.1/po/*.po
Languages: it, pl, zh_tw

source: ran loadkeys %s
it: eseguito loadkeys %s
pl: uruchomiono loadkeys %s
zh_tw: 執行載入鍵 %s

source: aliased %s as %s
it: alias di %s come %s
pl: utworzono alias %s do %s
zh_tw: 設 %s 的別名為 %s

source: do only 'safe' probes that won't disturb hardware
it: esegue solo rilevamenti 'sicuri' che non disturbano l'hardware
pl: wykonaj jedynie "bezpieczne" testy, które nie spowodują zaburzeń w pracy sprzętu
zh_tw: 只做 '安全的' 偵測，不會擾亂硬體

source: set timeout in seconds
it: imposta il timeout in secondi
pl: ustaw czas oczekiwania w sekundach
zh_tw: 以秒設定逾時時間

source: probe only, print information to stdout
it: solo rilevamento, stampa le informazioni sullo stdout
pl: tylko szukaj, wyświetl informację na standardowe wyjście
zh_tw: 只做偵測，印出相關訊息到 stdout

source: probe only the specified 'bus'
it: rileva solo il 'bus' specificato
pl: szukaj tylko określonej "magistrali"
zh_tw: 只偵測指定的 '匯流排'

source: probe only for the specified 'class'
it: rileva solo la 'classe' specificata
pl: szukaj tylko określonej "klasie"
zh_tw: 只偵測指定的 '類別'

source: read probed hardware from a file
it: legge le informazioni sull'hardware rilevato da un file
pl: odczytaj wyszukiwany sprzęt z pliku
zh_tw: 從檔案讀取偵測到的硬體

source: file to read hardware info from
it: file con le info sull'hardware
pl: plik z informacją o sprzęcie do odczytania
zh_tw: 用來讀取硬體資料的檔案

source: search for modules for a particular kernel version
it: cerca i moduli per una particolare versione del kernel
pl: szukaj modułów dla podanej wersji jądra
zh_tw: 搜尋用於特定核心版本的模組

source: kernel version
it: versione del kernel
pl: wersja jądra
zh_tw: 核心版本

source: read probed hardware from a socket
it: legge l'hardware rilevato da un socket

source: do configuration that doesn't require user input
it: fa una configurazione che non richieda input utente
pl: utwórz konfigurację, która nie wymaga udziału użytkownika
zh_tw: 執行不需要使用者輸入的組態設定

source: ERROR - You must be root to run kudzu.
it: ERRORE - Sono necessari i diritti di root per eseguire kudzu.
pl: BŁĄD - musisz być rootem, aby uruchomić kudzu.
zh_tw: 錯誤 - 您必須是 root 才能執行 kudzu。
