Repository: m23project/mdk-devel
Catalog: mdk/m23helper/kudzu-1.2.57.1.raus/po/*.po
Languages: bn, bn_in, es, gl, hr, hu, lv, ml, no, or, pt_br, ro, sv, vi

source: ran loadkeys %s
bn: %s loadkeys চালানো হয়েছে
bn_in: %s loadkeys চালানো হয়েছে
es: ejecutó loadkeys %s
gl: executouse loadkeys %s
hr: pokreni loadkeys %s
hu: loadkeys %s lefuttatva
lv: izpildīts loadkeys %s
no: kjørte loadkeys %s
or: ଧାରଣ ଚାବିକାଠି %s ଚାଲିଲା
pt_br: executei loadkeys %s
ro: s-a rulat loadkeys %s
sv: körde "loadkeys %s"
vi: đã chạy loadkeys %s

source: aliased %s as %s
bn: %s কে %s উপনাম প্রদান করা হয়েছে
bn_in: %s-র জন্য %s উপনাম ধার্য করা হয়েছে
es: alias creado para %s como %s
gl: fíxose un alias de %s como %s
hr: pseudonim imena %s je %s
hu: %s alias neve: %s
lv: %s kā pseidonīms %s
ml: %sനെ %s എന്ന അറിയപ്പെടുന്നു
no: laget alias %s til %s
or: %s ଟି %s ରେ ପୂନଃର୍ନାମିତ ହେଲା
pt_br: apelidei %s de %s
ro: s-a poreclit %s ca %s
sv: skapade alias för %s: %s
vi: bí danh %s là %s

source: do only 'safe' probes that won't disturb hardware
bn: হার্ডওয়্যারের কার্যক্রম বিঘ্নিত না করে শুধুমাত্র 'নিরাপদ' অনুসন্ধান করো
bn_in: হার্ডওয়্যারে বিশৃঙ্খলা না ঘটিয়ে কেবলমাত্র 'সুরক্ষিত' অনুসন্ধান করা হবে
es: realizar solamente sondeos 'seguros' que no perjudiquen el hardware
gl: facer só deteccións 'seguras' que non interfiran co hardware
hr: izvedi samo 'sigurna' istraživanja koje neće ometati hardver
hu: csak biztonságos vizsgálati módok használata (melyek nem állíthatják el a hardvert)
lv: izmantot tikai 'drošo' pārbaudi', kas neskar aparatūru
ml: ഹാറ്‍ഡ്വയറിന് ഉപദ്രവം ഉണ്ടാക്കാത്ത തരത്തിലുളള 'സുരക്ഷിത(സേഫ്)'മായ പ്രോബുകള്‍ മാത്രം ചെയ്യുക
no: kjør kun 'trygge' søk som ikke forstyrrer maskinvaren
or: କେବଳ 'safe' ବାକ୍ଯ କୁ ଖୋଜନ୍ତୁ ଯାହାକି ହାର୍ଡଓ୍ବାର କୁ ହଇରାଣ କରିବ ନାହିଁ
pt_br: fazer apenas procuras 'seguras' que não perturbaram o hardware
ro: ia doar probe „sigure” care nu deranjează hardware-ul
sv: utför endast "säkra" tester som inte kommer att störa hårdvaran
vi: chỉ thực hiện dò tìm 'an toàn' không làm phiền phần cứng

source: set timeout in seconds
bn: সময়সীমা সেকেন্ডে নির্ধারণ করো
bn_in: সেকেন্ড অনুসারে সময়সীমা নির্ধারণ করা হবে
es: fijar el tiempo de operación en segundos
gl: establecer tempo de espera en segundos
hr: zadaj vrijeme isključivanja u sekundama
hu: a várakozási idő másodpercben
lv: uzstādīt aizturi sekundēs
ml: ടൈം ഔട്ട് സെക്കന്‍ഡുകളില്‍ സെറ്റ് ചെയ്യുക
no: sett tidsavbrudd i sekunder
or: ସମାପ୍ତି ସମୟକୁ ସେକେଣ୍ଡ ରେ ସେଟ୍ କରନ୍ତୁ
pt_br: definir tempo limite em segundos
ro: setează limita de timp în secunde
sv: ställ in time-out i sekunder
vi: đặt thời hạn (giây)

source: probe only, print information to stdout
bn: কেবলমাত্র অনুসন্ধান করো, stdout-এ তথ্য প্রিন্ট করো
bn_in: কেবলমাত্র অনুসন্ধান করা হবে, stdout-এ তথ্য প্রিন্ট করা হবে
es: sondear únicamente; imprimir la información a la salida estándar (stdout)
gl: só analisar, escribir a información na saída estándar
hr: samo istraži, podatke ispiši na stdout
hu: csak vizsgálat; információ kiírása a standard kimenetre (stdout)
lv: tikai pārbaude, informāciju drukāt standarta izvadkanālā
ml: വിവരങ്ങള്‍ stdout ലേക്ക് അച്ചടിക്കുക
no: kun søk, skriv ut informasjon til stdout
or: କେବଳ ଖୋଜନ୍ତୁ, ସୂଚନା କୁ stdout ରେ ମୂଦ୍ରଣ କରନ୍ତୁ
pt_br: apenas sondar, escrever informações no stdout
ro: doar probează şi afişează informaţia
sv: testa endast, skriv information till standard ut
vi: chỉ dò tìm, in thông tin ra stdout

source: probe only the specified 'bus'
bn: কেবলমাত্র নির্ধারিত 'bus'-এ অনুসন্ধান করো
bn_in: কেবলমাত্র নির্ধারিত 'bus'-এ অনুসন্ধান করা হবে
es: comprobar sólo el 'bus' específico
gl: analisar únicamente o 'bus' especificado
hr: istraži samo određenu sabirnicu
hu: csak a megadott busz vizsgálata
lv: pārbaudīt tikai norādīto slēgumu ('bus')
ml: പറഞ്ഞിരിക്കുന്ന 'ബസ്' മാത്രം പ്രോബ് ചെയ്യുക
no: søk kun på spesifisert 'buss'
or: କେବଳ ଉଲ୍ଲେକ୍ଷିତ 'bus' କୁ ଖୋଜନ୍ତୁ
pt_br: sondar apenas o barramento especificado
ro: probează doar magistrala specificată
sv: testa endast den angivna bussen
vi: chỉ dò tìm 'bus' xác định

source: probe only for the specified 'class'
bn: কেবলমাত্র নির্ধারিত 'class'-এর জন্য অনুসন্ধান করো
bn_in: কেবলমাত্র নির্ধারিত 'class'-র জন্য অনুসন্ধান করা হবে
es: comprobar sólo la 'clase' específica
gl: analisar únicamente a 'clase' especificada
hr: istraži samo za određenu 'klasu'
hu: csak a megadott 'osztály' vizsgálata
lv: pārbaudīt tikai norādīto klasi
ml: പറഞ്ഞിരിക്കുന്ന 'ക്ളാസ്' മാത്രം പ്രോബ് ചെയ്യുക
no: søk kun etter spesifisert 'klasse'
or: କେବଳ ଉଲ୍ଲେକ୍ଷିତ 'class' କୁ ଖୋଜନ୍ତୁ
pt_br: sondar apenas pela 'classe' especificada
ro: probează doar pentru clasa specificată
sv: testa endast för den angivna klassen
vi: chỉ dò tìm 'class' xác định

source: read probed hardware from a file
bn: ফাইল থেকে সনাক্তকৃত হার্ডওয়্যার পড়ো
bn_in: সনাক্ত করা হার্ডওয়্যার ফাইল থেকে পড়া হবে
es: leer hardware monitorizado desde un fichero
gl: ler o hardware detectado dende un ficheiro
hr: čitaj istraženi hardver iz datoteke
hu: vizsgált hardvereszközök beolvasása fájlból
lv: informāciju par ierīcēm lasīt no datnes
ml: ഒരു ഫൈലില്‍ നിന്നും പ്രോബ് ചെയ്ത ഹാറ്‍ഡ്വയറ്‍ മാത്രം വായിക്കുക
no: les testet maskinvare fra en fil
or: ଖୋଜା ହୋଇଥିବା ହାର୍ଡଓ୍ବାର କୁ ଫାଇଲ ରୁ ପଢନ୍ତୁ
pt_br: ler hardware sondado de um arquivo
ro: citeşte hardware-ul detectat dintr-un fişier
sv: läs testad hårdvara från fil
vi: đọc phần cứng đã dò tìm từ tập tin

source: file to read hardware info from
bn: যে ফাইল থেকে হার্ডওয়ের সম্বন্ধে তথ্য পড়া হবে
bn_in: যে ফাইল থেকে হার্ডওয়্যার সম্বন্ধে তথ্য পড়া হবে
es: fichero para leer información sobre hardware
gl: ficheiro dende o que ler a información do hardware
hr: datoteka iz koje se čitaju podaci o hardveru
hu: hardverinformációt tartalmazó fájl
lv: datne, kas satur informāciju par ierīcēm
ml: ഹാറ്‍ഡ്വേറ്‍ വിവരങ്ങള്‍ അറിയുവാനുള്ള ഫൈല്‍
no: fil som maskinvareinformasjon skal leses fra
or: ହାର୍ଡଓ୍ବାର ସୂଚନା ପଢିବା ପାଇଁ ଫାଇଲ
pt_br: arquivo a partir do qual as informações sobre o hardware devem ser lidas
ro: fişierul din care se citesc informaţiile hardware
sv: fil som hårdvaruinformation ska läsas ifrån
vi: file để đọc thông tin phần cứng

source: search for modules for a particular kernel version
bn: একটি নির্ধারিত সংস্করণের কার্ণেলের জন্য মডিউল অনুসন্ধান করো
bn_in: কোনো নির্দিষ্ট কার্নেল সংস্করণের জন্য মডিউল অনুসন্ধান করা হবে
es: buscar módulos para una versión particular de kernel
gl: buscar módulos dunha versión específica do kernel
hr: traži module za određenu verziju kernela
hu: modulkeresési útvonal egy adott rednszermag esetén
lv: moduļu meklēšana konkrētai kodola versijai
ml: ഒരു പറ്‍ട്ടിക്കുലറ്‍ കേറ്‍ണല്‍ വേറ്‍ഷനുളള മൊഡ്യൂളുകള്‍ തിരയുക
no: søk etter moduler for en bestemt versjon av kjernen
or: ଗୋଟିଏ ନିର୍ଦ୍ଦିଷ୍ଟ କର୍ଣ୍ଣଲ ର ସଂସ୍କରଣ ପାଇଁ ଏକକାଂଶ ମାନ ଖୋଜ
pt_br: procurar pelos módulos de uma versão específica do kernel
ro: caută module pentru o versiune specifică de kernel
sv: sök efter moduler för en viss kärnversion
vi: tìm môđun cho phiên bản hạt nhân đặc biệt

source: kernel version
bn: কার্ণেল সংস্করণ
bn_in: কার্নেলের সংস্করণ
es: versión de kernel
gl: versión do kernel
hr: verzija kernela
hu: a rendszermag verziószáma
lv: kodola versija
ml: കേറ്‍ണല്‍ വേറ്‍ഷന്‍
no: kjerneversjoner
or: କର୍ଣ୍ଣଲ ର ସଂସ୍କରଣ
pt_br: versão do kernel
ro: versiune kernel
sv: kärnversion
vi: phiên bản hạt nhân

source: read probed hardware from a socket
bn: সকেট থেকে অনুসন্ধানকৃত হার্ডওয়্যার পড়ো
bn_in: সনাক্ত করা হার্ডওয়্যার একটি সকেট থেকে পড়া হবে
es: leer hardware monitorizado desde un socket (conector)
gl: ler o hardware detectado dende un socket
hu: vizsgált hardvereszközök beolvasása socketből
lv: informāciju par ierīcēm lasīt no ligzdas
ro: citeşte hardware-ul detectat de la-un conector (socket)

source: do configuration that doesn't require user input
bn: ব্যবহারকারীর ইনপুট এর সাহায্য ছাড়া কনফিগারেশন করো
bn_in: ব্যবহারকারীর থেকে কোনো ধরনের ইনপুট বিনা কনফিগারেশন করা হবে
es: Configuración sin solicitar la entrada del usuario
gl: configurar sen requirir a intervención do usuario
hr: izradi konfiguraciju koja ne zahtijeva korisnički unos
hu: felhasználói beavatkozás nélküli beállítás
lv: konfigurēt to, kur nav nepieciešama lietotāja iejaukšanās
ml: യൂസറിന്‍റെ ഇന്‍പുട്ട് ആവശ്യമില്ലാത്ത കോണ്‍ഫിഗറേഷന്‍ ചെയ്യുക
no: kjør konfigurasjon som ikke behøver input fra bruker
or: ଏପରି ବିନ୍ଯାସ କରନ୍ତୁ ଯାହାକି ଚାଳକ ର ନିବେଶ କୁ ଆବଶ୍ଯକ କରେନାହିଁ
pt_br: faça a configuração que não requer uma entrada de usuário
ro: fă configuraţia care nu necesită intervenţia utilizatorului
sv: utför konfiguration som inte kräver inmatning från användare
vi: thực hiện cấu hình không cần hỏi người dùng

source: ERROR - You must be root to run kudzu.
bn: সমস্যা - Kudzu চালাতে হলে আপনাকে root পরিচয় ব্যবহার করতে হবে।
bn_in: ত্রুটি - Kudzu চালানোর জন্য root পরিচয় ব্যবহার করা আবশ্যক।
es: ERROR - Debe ser root para poder ejecutar kudzu.
gl: ERRO - Debe ser root para executar kudzu.
hr: POGREŠKA - Da biste pokrenuli kudzu morate biti root korisnik.
hu: HIBA - a Kudzu futtatásához rendszergazdai (root) jogosultság szükséges.
lv: KĻŪDA - Lai lietotu kudzu, Jums jāpieslēdzas kā root.
ml: ERROR - കുഡ്സു പ്രവറ്‍ത്തിപ്പിക്കുവാന്‍ നിങ്ങള്‍ റൂട്ട് ആയിരിക്കണം.
no: FEIL - Du må være root for å kjøre kudzu.
or: ତ୍ରୁଟି - kudzu କୁ ଚଳାଇବା ପାଇଁ ଆପଣ ମୂଖ୍ଯ ଚାଳକ ହେବା ଆବଶ୍ଯକ
pt_br: ERRO - Você deve ser root para executar o kudzu.
ro: EROARE - Trebuie să fiţi root pentru a rula kudzu.
sv: FEL - Du måste vara root för att kunna köra kudzu.
vi: LỖI - Bạn phải là root mới có thể chạy kudzu.
