<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Starten der Installation</TITLE>
<META NAME="description" CONTENT="Starten der Installation">
<META NAME="keywords" CONTENT="manual">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="manual.css">

<LINK REL="next" HREF="node22.html">
<LINK REL="previous" HREF="node20.html">
<LINK REL="up" HREF="node19.html">
<LINK REL="next" HREF="node22.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html678"
  HREF="node22.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html674"
  HREF="node19.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html668"
  HREF="node20.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html676"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html679"
  HREF="node22.html">Abschluﬂ der Installation</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html675"
  HREF="node19.html">Serverinstallation</A>
<B> Vorherige Seite:</B> <A NAME="tex2html669"
  HREF="node20.html">Vorbereitungen</A>
 &nbsp; <B>  <A NAME="tex2html677"
  HREF="node1.html">Inhalt</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00420000000000000000">
Starten der Installation</A>
</H1>
Schlie&#223;en Sie den Server an Ihr Netzwerk an und legen die m23-Server-Installations-CD in das Laufwerk. Halten Sie die erforderlichen Netzwerkeinstellungen bereit. Die Installation ist gr&#246;&#223;tenteils selbsterkl&#228;rend und sollte jemandem, der sich mit den grundlegenden Begriffen der Netzwerkadministration auskennt, keine Schwierigkeiten bereiten. Im Folgenden sehen Sie Screenshots der Installation, die der Server durchlaufen wird. Machen Sie sich keine Sorgen, wenn in der Installationsprozedur noch andere Bildschirme auftauchen, da ich es nicht f&#252;r sinnvoll hielt, alle Status-Meldungen als Screenshot zu zeigen ;).
<BR>
<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst1.png"
 ALT="Image inst1">
<BR>
Dies ist der Bootbildschirm der m23-Server-Installations-CD. Nach Dr&#252;cken der Enter-Taste bootet das Linux-Betriebssystem von der CD und startet das Installationsprogramm.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst2.png"
 ALT="Image inst2">
<BR>
Sie k&#246;nnen w&#228;hlen, ob Sie das Installationsprogramm in deutscher oder englischer Sprache ausf&#252;hren wollen. Wir gehen hier davon aus, da&#223; Sie sich f&#252;r deutsch entscheiden.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst3.png"
 ALT="Image inst3">
<BR>
Eine kleine Begr&#252;&#223;ung.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst4.png"
 ALT="Image inst4">
<BR>
Eingabe des Root-Pa&#223;wortes. Root ist der Systemadministrator mit uneingeschr&#228;nktem Zugriff auf den m23-Server. Sie sollten ein Pa&#223;wort w&#228;hlen, das nicht leicht erraten werden kann und mindestens 10 Zeichen enth&#228;lt. Ebenfalls sollten Sie Sonderzeichen, Ziffern, sowie Gro&#223;- und Kleinschreibung verwenden.
<BR>
Da das Pa&#223;wort nicht angezeigt wird, wird es im darauffolgenden Dialog noch einmal durch erneute Eingabe &#252;berpr&#252;ft.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst5.png"
 ALT="Image inst5">
<BR>
Der Hostname ist der Name f&#252;r den Server. Was f&#252;r eine Erkl&#228;rung ;)

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst6.png"
 ALT="Image inst6">

<BR>
Die IP-Adresse, unter der auf den Server zugegriffen werden soll. Diese Adresse sollte so gew&#228;hlt werden, da&#223; die Clients von dem Server ohne Router erreicht werden k&#246;nnen.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst7.png"
 ALT="Image inst7">
<BR>
Die Netzwerk-Adresse ist die IP-Adresse, unter der das Netzwerk erreichbar ist.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst8.png"
 ALT="Image inst8">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst9.png"
 ALT="Image inst9">

<BR>
Die Netzwerkmaske gibt an, welcher Teil der IP zu den einzelnen Rechnern geh&#246;rt und welcher das Netzwerk maskiert.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst10.png"
 ALT="Image inst10">

<BR>
Die Gateway-IP gibt die IP an, &#252;ber die Anfragen an IPs geleitet werden, die nicht innerhalb des Netzwerkes des Servers liegen. Dies wird vor allem f&#252;r den Zugriff auf das Internet ben&#246;tigt.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst11.png"
 ALT="Image inst11">

<BR>
F&#252;r die Aufl&#246;sung von URL-Namen in IP-Adressen wird ein DNS-Server ben&#246;tigt, der die Umwandlung vornimmt. Aus ftp.debian.org wird z.B. 128.101.80.131. Falls Sie keinen DNS-Server kennen, k&#246;nnen Sie die IP 134.245.10.36 benutzen. Dies ist der DNS-Server der Universit&#228;t Kiel.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst12.png"
 ALT="Image inst12">

<BR>
An dieser Stelle haben Sie noch einmal die M&#246;glichkeit, zu &#252;berpr&#252;fen, ob Ihre Angaben alle korrekt sind. Falls Sie die Installation fortsetzen m&#246;chten, dann w&#228;hlen Sie &#34;Yes&#34;, ansonsten k&#246;nnen Sie nach der Auswahl von &#34;No&#34; die korrigierten Angaben eingeben.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst13.png"
 ALT="Image inst13">

<BR>
Hier k&#246;nnen Sie ausw&#228;hlen, ob Sie die komplette Festplatte des Servers f&#252;r m23 verwenden wollen. Dann werden 2 Partitionen eingerichtet, eine f&#252;r das Debian-Linux-Betriebssystem und eine als Swapbereich. Sollten mehrere Festplatten vorhanden sein, so wird die erste benutzt. Sie k&#246;nnen allerdings auch zuvor angelegte Partitionen verwenden, falls Sie eine spezielle Partitionierung w&#252;nschen.
<BR>
<BR><SPAN ID="txt115">Hinweise zur Partitionierung</SPAN>
Bitte beachten Sie, da&#223; w&#228;hrend der Installation entweder der Server komplett gel&#246;scht wird, oder Sie vorher mit einem Programm wie Parted, fdisk, cfdisk etc. zwei Partitionen der ersten Festplatte (hda bzw. sda) wie folgt erstellen m&#252;ssen:

<UL>
<LI>eine Partition f&#252;r m23 mit einer Gr&#246;&#223;e von mindestens 4 GB
</LI>
<LI>eine Partition zum Swappen f&#252;r Linux (Empfohlen ist hier die doppelte Gr&#246;&#223;e des Arbeitsspeichers)
</LI>
</UL>
Schreiben Sie sich bitte die Adressen der Partitionen auf, d.h. die erste Partition der ersten Festplatte hei&#223;t z.B. hda1, die zweite Partition hda2. Wenn Sie eine Erweiterte- bzw. Extended-Partition benutzen, dann hei&#223;t die erste Partition innerhalb der Erweiterten-Partition hda5 und die zweite hda6 usw. Sie werden w&#228;hrend der Installation nach diesen Adressen gefragt, sofern Sie die Experten-Einstellung zum Partitionieren gew&#228;hlt haben.
Wir empfehlen f&#252;r die meisten Benutzer allerdings, die Daten vorher zu sichern und m23 den kompletten Server partitionieren und formatieren zu lassen.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst14.png"
 ALT="Image inst14">

<BR>
Die letzte Warnung, bevor es losgeht ;)

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst15.png"
 ALT="Image inst15">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst16.png"
 ALT="Image inst16">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst17.png"
 ALT="Image inst17">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst18.png"
 ALT="Image inst18">

<BR>
Hier k&#246;nnen Sie entscheiden, ob Sie den Bootmanager LILO (LInux LOader) installieren wollen. Dieser wird im MBR (MasterBootRecord) der ersten Festplatte installiert. Sollten Sie sich dagegen entscheiden, so m&#252;ssen Sie selbst einen Bootmanager installieren. Ansonsten ist der m23-Server nicht bootf&#228;hig.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst19.png"
 ALT="Image inst19">

<BR>
Die Installation ist abgeschlossen ;)

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html678"
  HREF="node22.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html674"
  HREF="node19.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html668"
  HREF="node20.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html676"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html679"
  HREF="node22.html">Abschluﬂ der Installation</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html675"
  HREF="node19.html">Serverinstallation</A>
<B> Vorherige Seite:</B> <A NAME="tex2html669"
  HREF="node20.html">Vorbereitungen</A>
 &nbsp; <B>  <A NAME="tex2html677"
  HREF="node1.html">Inhalt</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
root
2013-08-18
</ADDRESS>
</BODY>
</HTML>
