<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Paketquellen-Architekt (Paketquellen und Pakete auswählen)</TITLE>
<META NAME="description" CONTENT="Paketquellen-Architekt (Paketquellen und Pakete auswählen)">
<META NAME="keywords" CONTENT="manual">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="manual.css">

<LINK REL="next" HREF="node201.html">
<LINK REL="previous" HREF="node198.html">
<LINK REL="up" HREF="node194.html">
<LINK REL="next" HREF="node200.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html3063"
  HREF="node200.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html3059"
  HREF="node194.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html3053"
  HREF="node198.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html3061"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html3064"
  HREF="node200.html">Hinweis</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html3060"
  HREF="node194.html">Paketquellenarchitekt</A>
<B> Vorherige Seite:</B> <A NAME="tex2html3054"
  HREF="node198.html">Paketquellen-Architekt (Paket-Index erstellen)</A>
 &nbsp; <B>  <A NAME="tex2html3062"
  HREF="node1.html">Inhalt</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION001340000000000000000">
Paketquellen-Architekt (Paketquellen und Pakete ausw&#228;hlen)</A>
</H1>
<IMG
  WIDTH="1186" HEIGHT="1444" ALIGN="BOTTOM" BORDER="0"
 SRC="./poolBuilderSelectPackageSourcesAndPackages.png"
 ALT="Image poolBuilderSelectPackageSourcesAndPackages"> 
<BR>
W&#228;hlen Sie hier aus, von welchen Paketquellen Sie welche Pakete beziehen m&#246;chten. Der Dialog setzt sich aus 2 Teilen zusammen:
<BR>
<OL>
<LI>W&#228;hlen Sie zuerst die Paketquellen aus.
<BR>
<UL>
<LI><SPAN  CLASS="textbf">Laden einer Paketquelle</SPAN>: Zum Laden w&#228;hlen Sie rechts oben aus der Liste die Paketquelle aus, die Sie laden m&#246;chten. Nach Klicken auf <SPAN  CLASS="textit">''Laden''</SPAN> wird diese in den Editor geladen.
<BR></LI>
<LI><SPAN  CLASS="textbf">L&#246;schen der Paketquelle</SPAN>: Um die in den Editor geladene Paketquelle zu l&#246;schen, klicken Sie auf dem <SPAN  CLASS="textit">''L&#246;schen''</SPAN>-Button und stimmen im nachfolgenden Dialog dem L&#246;schen zu.
<BR></LI>
<LI><SPAN  CLASS="textbf">Speichern der Paketquelle</SPAN>: Es wird immer die in den Editor geladene Paketquelle gespeichert, unabh&#228;ngig davon, welche rechts oben in der Auswahlliste angezeigt wird. W&#228;hlen Sie zuerst die Distribution aus, f&#252;r die die Paketliste gelten soll. Nach der Distributionswahl kann es geschehen, da&#223; Sie zus&#228;tzlich Angaben zu der Distribution machen m&#252;ssen. W&#228;hlen Sie zus&#228;tzlich die Benutzeroberfl&#228;chen aus der Liste unter dem Editor sowie die Rechnerarchitektur(en) unter <SPAN  CLASS="textit">''Rechnerarchitektur''</SPAN> aus, die von der Paketquellenliste unterst&#252;tzt werden. Suchen Sie einen Namen f&#252;r die Paketliste aus und tragen Sie diesen in das Eingabefeld unter <SPAN  CLASS="textit">''Paketquellenliste''</SPAN> ein. Sollten Sie eine Paketquelle geladen haben, so wird der Name automatisch eingetragen. Wenn Sie m&#246;chten, k&#246;nnen Sie einen Kommentar in das Feld <SPAN  CLASS="textit">''Beschreibung''</SPAN> eingeben. Klicken Sie anschlie&#223;end auf <SPAN  CLASS="textit">''Speichern''</SPAN>.
<BR></LI>
<LI><SPAN  CLASS="textbf">Paketquelle testen</SPAN>: Nachdem Sie eine Paketquelle eingegeben haben, sollten Sie testen, ob alle Quellen ordnungsgem&#228;&#223; funktionieren. Nach einem Klick auf den <SPAN  CLASS="textit">''Test''</SPAN>-Button wird versucht, die Paketbeschreibungen der Quellen herunterzuladen. Nach Abschlu&#223; des Testes wird unten ein Testbericht angezeigt. Es kann durchaus mehrere Minuten dauern, bis der Testbericht erscheint. Dies ist abh&#228;ngig von der Geschwindigkeit Ihrer Internetverbindung und der Geschwindigkeit der benutzten Quellpaket-Server.
<BR></LI>
<LI><SPAN  CLASS="textbf">Mirror angeben</SPAN>: M&#246;chten Sie einen anderen Mirror (voreingestellt ist ftp.debian.org) f&#252;r die Installation des Basissystems verwenden, so geben Sie diesen in einer neuen Zeile der Paketquelle wie folgt an: 
<BR><PRE>
#mirror: [URL zu den Paketen]
</PRE>
. Mit <SPAN  CLASS="textit">URL zu den Paketen</SPAN> ist das Protokoll, der Hostname bzw. die IP und das Verzeichnis gemeint, wo die Pakete zu finden sind. Eine g&#252;ltige Zeile k&#246;nnte z.B. so aussehen 
<BR><PRE>
#mirror: http://192.168.7.14/debianCDs
</PRE>
.
<BR></LI>
<LI><SPAN  CLASS="textbf">Konfigurationsdateien erstellen</SPAN>: Jede Paketquellenliste bietet die M&#246;glichkeit, zus&#228;tzliche Dateien (z.B. zur Konfiguration des Paketmanagers) zu erstellen. F&#252;gen Sie f&#252;r jede zu erstellende Datei eine neue Zeile nach dem Schema
<BR><PRE>
#addToFile:[Dateiname mit voller Pfadangabe]###[1. Zeile]###[2. Zeile]
</PRE>
	ein. Ersetzen Sie hierbei <SPAN  CLASS="textit">''[Dateiname mit voller Pfadangabe]''</SPAN> durch die n&#246;tige Angabe (z.B. /etc/apt/preferences). Die Zeilen der Ausgabedatei werden in der Paketquellenliste statt durch einen Zeilenumbruch durch die drei Rauten (###) gekennzeichnet, da das komplette Kommando zum Anlegen einer Datei in einer Zeile stehen mu&#223;.
<BR></LI>
<LI><SPAN  CLASS="textbf">Unterst&#252;tzte Dateisysteme</SPAN>: Jede Distribution unterst&#252;tzt eine Reihe von Dateisystemen. Diese k&#246;nnen aber von Distribution zu Distribution variieren. In einer eigenen Zeile listen Sie deshalb die unterst&#252;tzten Dateisysteme auf:
<BR><PRE>
#supportedFS: [Dateisystem 1], [Dateisystem 2], [Dateisystem 3]
</PRE>
	Sie k&#246;nnen in der Zeile beliebig viele (durch Komma und Leerzeichen getrennte) Dateisysteme angeben (z.B. 
<BR><PRE>
#supportedFS: ext2, ext3, ext4, reiserfs
</PRE>
).
<BR>
Sollte beim Formatieren eines Clients ein nicht unterst&#252;tztes Dateisystem ausgew&#228;hlt werden, so findet beim eigentlichen Formatieren automatisch eine Anpassung auf ein unterst&#252;tztes Dateisystem statt. Dieses R&#252;ckfall-Dateisystem geben Sie in der Zeile
<BR><PRE>
#alternativeFS: [Dateisystem]
</PRE>
	an (z.B. 
<BR><PRE>
#alternativeFS: ext3
</PRE>
).
<BR></LI>
</UL>
Letztendlich wird die im Fenster <SPAN  CLASS="textit">''Paketquellenliste''</SPAN> angezeigte Liste benutzt.
<BR></LI>
<LI>Im unteren Teil des Dialogs geben Sie die Pakete an, die Sie in die Paketquelle herunterladen m&#246;chten. Die Pakete werden dabei durch Leerzeichen getrennt.
<BR>
<UL>
<LI><SPAN  CLASS="textbf">Laden / L&#246;schen:</SPAN> Haben Sie bereits eine Paketliste gespeichert, so k&#246;nnen Sie diese nach Auswahl unter <SPAN  CLASS="textit">''Paketliste''</SPAN> mit einem Klick auf den <SPAN  CLASS="textit">''Laden''</SPAN>-Button in das Editierfenster laden bzw. mit <SPAN  CLASS="textit">''L&#246;schen''</SPAN> entfernen.
<BR></LI>
<LI><SPAN  CLASS="textbf">Hinzuf&#252;gen</SPAN>: Sie k&#246;nnen die Pakete aus der Paketliste zu denen im Editor hinzuf&#252;gen, indem Sie auf <SPAN  CLASS="textit">''Hinzuf&#252;gen''</SPAN> klicken.
<BR></LI>
<LI><SPAN  CLASS="textbf">Speichern</SPAN>: M&#246;chten Sie die Liste im Editor speichern, so geben Sie einen Namen in der Eingabezeile <SPAN  CLASS="textit">''Paketliste''</SPAN> ein und klicken Sie anschlie&#223;end auf <SPAN  CLASS="textit">''Speichern''</SPAN>.
<BR></LI>
<LI><SPAN  CLASS="textbf">Pakete vom Client hinzuf&#252;gen</SPAN>: Diese Option ist besonders hilfreich, wenn Sie Pakete von bereits installierten Clients in die Paketquelle herunterladen m&#246;chten. Um alle Pakete eines Clients hinzuzuf&#252;gen w&#228;hlen Sie den Client aus der Liste aus (es werden nur Clients angezeigt, die Pakete installiert haben) und klicken anschlie&#223;end auf <SPAN  CLASS="textit">''Hinzuf&#252;gen''</SPAN>. Sie k&#246;nnen auch Pakete von mehreren Clients hinzuf&#252;gen, wobei mehrfach vorkommende Pakete nur einmal in die Liste aufgenommen werden.
<BR></LI>
</UL>
</LI>
<LI>Aktivieren Sie die Option <SPAN  CLASS="textit">''Basispakete herunterladen''</SPAN> so werden alle Dateien (au&#223;er dem Clientkernel) mit heruntergeladen, die n&#246;tig sind, um das Basissystem zu installieren.
<BR></LI>
<LI>Klicken Sie abschlie&#223;end auf <SPAN  CLASS="textit">''N&#228;chster Schritt (Download starten)''</SPAN>
</LI>
</OL>
<BR><HR>
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Unterabschnitte</STRONG></A>

<UL CLASS="ChildLinks">
<LI><A NAME="tex2html3065"
  HREF="node200.html">Hinweis</A>
</UL>
<!--End of Table of Child-Links-->

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html3063"
  HREF="node200.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html3059"
  HREF="node194.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html3053"
  HREF="node198.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html3061"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html3064"
  HREF="node200.html">Hinweis</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html3060"
  HREF="node194.html">Paketquellenarchitekt</A>
<B> Vorherige Seite:</B> <A NAME="tex2html3054"
  HREF="node198.html">Paketquellen-Architekt (Paket-Index erstellen)</A>
 &nbsp; <B>  <A NAME="tex2html3062"
  HREF="node1.html">Inhalt</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
root
2015-04-30
</ADDRESS>
</BODY>
</HTML>
