<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Hinweis</TITLE>
<META NAME="description" CONTENT="Hinweis">
<META NAME="keywords" CONTENT="manual">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="manual.css">

<LINK REL="next" HREF="node104.html">
<LINK REL="previous" HREF="node102.html">
<LINK REL="up" HREF="node102.html">
<LINK REL="next" HREF="node104.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html1775"
  HREF="node104.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html1771"
  HREF="node102.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html1765"
  HREF="node102.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html1773"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html1776"
  HREF="node104.html">Hinweis:</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html1772"
  HREF="node102.html">Client hinzufügen</A>
<B> Vorherige Seite:</B> <A NAME="tex2html1766"
  HREF="node102.html">Client hinzufügen</A>
 &nbsp; <B>  <A NAME="tex2html1774"
  HREF="node1.html">Inhalt</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H2><A NAME="SECTION00911000000000000000">
Hinweis</A>
</H2>
Alle mit m23 0.6.4 oder h&#246;her installierten Clients beinhalten einen Pa&#223;wortschutz, der das Editieren der Bootparameter verhindert. Zum Freischalten der Bootmanager-Editierfunktion ist die Eingabe des Netzwerkbootpa&#223;wortes n&#246;tig. Dies kann im Kontrollzentrum unter <SPAN  CLASS="textit">&#34;Client-Direkt-Verbindung&#34;</SPAN> abgefragt werden.
<BR><SPAN  CLASS="textbf">Rechnerarchitektur:</SPAN> Wahl ob 32- oder 64-bittige Software auf dem Client installiert werden soll. Sehen Sie hierzu auch den Hinweis unten auf der Seite.
<BR><SPAN  CLASS="textbf">MAC-Adresse:</SPAN> MAC-Adresse der Client-Netzwerkkarte (z.B. 00D0B723865C)
<BR><SPAN  CLASS="textbf">IP-Adresse:</SPAN> gew&#252;nschte IP-Adresse des Clients (z.B. 192.168.1.23)
<BR><SPAN  CLASS="textbf">Netzwerkmaske:</SPAN> Netzwerkmaske des Netzwerkes (z.B. 255.255.255.0)
<BR><SPAN  CLASS="textbf">Gateway:</SPAN> Gateway-IP f&#252;r Internet- oder andere Verbindungen au&#223;erhalb des Netzwerkes
<BR><SPAN  CLASS="textbf">DNS1:</SPAN> IP-Adresse des DNS-Servers zum Aufl&#246;sen der Internetnamen
<BR><SPAN  CLASS="textbf">DNS2 (optional):</SPAN> IP des Backup-DNS-Servers
<BR><SPAN  CLASS="textbf">Paket-Proxy:</SPAN> Der Client versucht die Softwarepakete von der angegebenen Proxy-Server-IP zu beziehen. Im Standardfall ist dies die IP des m23-Servers, alternativ kann auch ein anderer Proxy-Server angegeben werden. Wenn das Feld leer gelassen wird, so l&#228;dt der Client die Softwarepakete aus dem Internet herunter. Geben Sie bitte auch die Port-Addresse der Proxy-Servers an. Beim m23-Server ist dies der Port 2323. Wird der <SPAN  CLASS="textit">&#34;Client hinzuf&#252;gen&#34;</SPAN>-Dialog ge&#246;ffnet, so ist der m23-Server als Proxy voreingestellt.
<BR><SPAN  CLASS="textbf">Gruppe (optional):</SPAN> Angabe der Clientgruppe f&#252;r den Client
<BR><SPAN  CLASS="textbf">Benutzer-Pa&#223;wort:</SPAN> Es wird standardm&#228;&#223;ig ein 6-stelliges Zufallspa&#223;wort erstellt, das f&#252;r den ersten Login auf dem Client benutzt wird. Sie k&#246;nnen aber auch ein anderes Passwort vorgeben.
<BR><SPAN  CLASS="textbf">Root-Pa&#223;wort:</SPAN> Es wird standardm&#228;&#223;ig ein 8-stelliges Zufallspa&#223;wort erstellt, das f&#252;r den Root-Zugang auf dem Client benutzt wird. Sie k&#246;nnen aber auch ein anderes Passwort vorgeben.
<BR><SPAN  CLASS="textbf">Zeitzone:</SPAN> Hier k&#246;nnen Sie die Zeitzone festlegen, die von Client benutzt werden soll.
<BR><SPAN  CLASS="textbf">Systemzeit per NTP ermitteln:</SPAN> Setzen Sie diese Option, wenn Sie w&#252;nschen, da&#223; die Uhrzeit des Clients beim Systemstart &#252;ber das Internet abgeglichen werden soll.
<BR><SPAN  CLASS="textbf">Druckertreiber installieren und angeschlossene Drucker erkennen:</SPAN> Wenn Sie diese Option w&#228;hlen, werden Druckertreiber auf dem Client installiert sowie angeschlossene Drucker erkannt.
<BR><SPAN  CLASS="textbf">Anmeldungsdaten lokal auf dem Client speichern.:</SPAN>Setzen Sie hier einen Haken, um die lokale Benutzeranmeldung des Clients zu verwenden.
<BR><SPAN  CLASS="textbf">LDAP nicht benutzen</SPAN>: Um nur die lokale Benutzeranmeldung des Clients zu verwenden, w&#228;hlen Sie <SPAN  CLASS="textit">&#34;LDAP nicht benutzen&#34;</SPAN>. 
<BR><SPAN  CLASS="textbf">Anmeldungsdaten vom gew&#228;hlten LDAP-Server lesen.</SPAN>: W&#252;nschen Sie hingegen, die bereits in einen LDAP-Server eingetragene Benutzerauthentifizierungsdaten zu nutzen, klicken Sie auf <SPAN  CLASS="textit">&#196;nmeldungsdaten vom gew&#228;hlten LDAP-Server lesen.&#34;</SPAN>.
<BR><SPAN  CLASS="textbf">Anmeldungsdaten in den LDAP-Server speichern.</SPAN>: Wollen Sie hingegen die oben angegebenen Benutzerdaten in die LDAP-Datenbank des m23-Servers eintragen und f&#252;r Clientlogins nutzen, so w&#228;hlen Sie <SPAN  CLASS="textit">&#196;nmeldungsdaten in den LDAP-Server speichern.&#34;</SPAN>. Bei Auswahl dieser Option ist ein LDAP-Server mit Vollzugriff erforderlich, da die oben angegebenen Benutzerdaten auf dem LDAP geschrieben werden.
<BR><SPAN  CLASS="textbf">Benutzer-ID, Gruppen-ID</SPAN>: Zus&#228;tzlich m&#252;ssen Sie die <SPAN  CLASS="textit">&#34;Benutzer-ID&#34;</SPAN> und <SPAN  CLASS="textit">&#34;Gruppen-ID&#34;</SPAN> f&#252;r den Benutzer ausw&#228;hlen. Dies ist insbesondere wichtig, wenn Sie NFS f&#252;r das Speichern der Heimatverzeichnisse verwenden wollen.
<BR><SPAN  CLASS="textbf">LDAP-Servername</SPAN>: Zuletzt m&#252;ssen Sie einen LDAP-Server aus der Auswahlliste bei <SPAN  CLASS="textit">&#34;LDAP-Servername&#34;</SPAN> ausw&#228;hlen. Sollte der gew&#252;nschte LDAP-Server nicht vorhanden sein, so k&#246;nnen Sie ihn durch einen Klick auf <SPAN  CLASS="textit">&#34;LDAP-Server verwalten&#34;</SPAN> hinzuf&#252;gen.
<BR><SPAN  CLASS="textbf">Heimatverzeichnis auf NFS:</SPAN> Diese Option sorgt daf&#252;r, da&#223; die Benutzerdaten auf einem zentralen NFS-Server gespeichert werden, soda&#223; auf diese (in Kombination mit LDAP) von jedem Client aus zugegriffen werden kann. Um NFS zu aktivieren, geben Sie den Rechnernamen bzw. die IP-Adresse und den Pfad zum Speichern der Heimatverzeichnisse an z.B. 
<BR><PRE>
192.168.1.42/nfs/home
</PRE>
.
<BR>
<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html1775"
  HREF="node104.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html1771"
  HREF="node102.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html1765"
  HREF="node102.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html1773"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> N&auml;chste Seite:</B> <A NAME="tex2html1776"
  HREF="node104.html">Hinweis:</A>
<B> Aufw&auml;rts:</B> <A NAME="tex2html1772"
  HREF="node102.html">Client hinzufügen</A>
<B> Vorherige Seite:</B> <A NAME="tex2html1766"
  HREF="node102.html">Client hinzufügen</A>
 &nbsp; <B>  <A NAME="tex2html1774"
  HREF="node1.html">Inhalt</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
root
2013-08-18
</ADDRESS>
</BODY>
</HTML>
