<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Préface</TITLE>
<META NAME="description" CONTENT="Préface">
<META NAME="keywords" CONTENT="manual">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="manual.css">

<LINK REL="next" HREF="node3.html">
<LINK REL="previous" HREF="node1.html">
<LINK REL="up" HREF="manual.html">
<LINK REL="next" HREF="node3.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html498"
  HREF="node3.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html494"
  HREF="manual.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html488"
  HREF="node1.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html496"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> suivant:</B> <A NAME="tex2html499"
  HREF="node3.html">Introduction</A>
<B> monter:</B> <A NAME="tex2html495"
  HREF="manual.html">Manuel de l'utilisateur pour</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html489"
  HREF="node1.html">Table des mati&#232;res</A>
 &nbsp; <B>  <A NAME="tex2html497"
  HREF="node1.html">Table des mati&#232;res</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00200000000000000000">
Pr&#233;face</A>
</H1>
Qui est-ce qui a vraiment envie d'installer et d'administrer des ordinateurs sans cesse? Probablement personne ;). Le but de l'utilisation d'un ordinateur, c'est de faciliter la vie - mais surtout les syst&#232;mes d'exploitation modernes montrent une faim insatiable de notre attention.
<BR>
Ici manque un pilote, l&#224; la licence d'une version d'essai est expir&#233;e et le r&#233;seau ne fonctionne non plus de nouveau.Peut-&#234;tre que la derni&#232;re annexe de courrier &#233;lectronique ait d&#233;vor&#233; la pile TCP-IP?...
<BR>
Cela vous semble familier? &#192; cause de la frustration d' in certain syst&#232;me d'exploitation, pour pouvoir conna&#238;tre le Linux encore mieux et en suivant le plan de d&#233;veloppeer du logiciel dont on a vraiment besoin, on a cr&#233;&#233; le syst&#232;me de distribution de logiciel m23.
<BR>
m23 n'aurait pas &#233;t&#233; possible sans la grande commune de d&#233;veloppeurs, qui y cr&#233;e de nouveaux programmes et les am&#233;liore toujours. Ici un grand merci &#224; tous ceux qui investissent leur &#233;nergie et leur loisirs dans le d&#233;veloppement d'un syst&#232;me d'exploitation libre avec tous les composants et applications n&#233;cessaires.
<BR>
Linux offre de la technologie libre d'une haute qualit&#233; qui peut &#234;tre utilis&#233;e de tout le monde sans paie de redevances. Chacun peut faire passer, copier et changer Linux - de cette fa&#231;on personne ne sera exclu parce qu'il n'a pas les moyens de payer les ch&#232;res licences. Linux offre l'occasion unique de se lib&#233;rer des pratiques professionnelles parfois assez douteuses de quelques grandes soci&#233;t&#233;s. Linux apporte de l'&#233;galit&#233; de chances pour tous!
<BR>
Pour cette raison, m23 est aussi mis sous une licence libre (plus sur ce sujet au prochain chapitre). Une autre raison pour le d&#233;veloppement de m23, c'&#233;tait de rendre Linux int&#233;ressant pour des gens qui ont peu de connaissance de l'installation et de l'administration des ordinateurs Linux. En plus, la distribution de Linux doit &#234;tre avanc&#233;e avec m23 pour rendre possible l'acc&#232;s &#224; la technique moderne &#224; un plus grand nombre de personnes. Les hommes qui vivent dans les pays en voie de d&#233;veloppement et pays &#233;mergents ne doivent pas devenir d&#233;pendants des grandes soci&#233;t&#233;s, qui auront &#224; peine l'int&#233;r&#234;t d'y soutenir le d&#233;veloppement libre de la technologie. Seuls les solutions &#224; code libre offrent cette libert&#233; et donnent la possibilit&#233; d'un d&#233;veloppement autonome &#224; chacun.
<BR>
<BR>
<DIV ALIGN="RIGHT">
Hauke Goos-Habermann
<BR>
Responsable de projet d'm23

</DIV>

<P>

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html498"
  HREF="node3.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html494"
  HREF="manual.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html488"
  HREF="node1.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html496"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> suivant:</B> <A NAME="tex2html499"
  HREF="node3.html">Introduction</A>
<B> monter:</B> <A NAME="tex2html495"
  HREF="manual.html">Manuel de l'utilisateur pour</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html489"
  HREF="node1.html">Table des mati&#232;res</A>
 &nbsp; <B>  <A NAME="tex2html497"
  HREF="node1.html">Table des mati&#232;res</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
root
2017-06-22
</ADDRESS>
</BODY>
</HTML>
