<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Commencer avec l'installation</TITLE>
<META NAME="description" CONTENT="Commencer avec l'installation">
<META NAME="keywords" CONTENT="manual">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="manual.css">

<LINK REL="next" HREF="node21.html">
<LINK REL="previous" HREF="node19.html">
<LINK REL="up" HREF="node18.html">
<LINK REL="next" HREF="node21.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html680"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html676"
  HREF="node18.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html670"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html678"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> suivant:</B> <A NAME="tex2html681"
  HREF="node21.html">Fin de l'installation</A>
<B> monter:</B> <A NAME="tex2html677"
  HREF="node18.html">Installation du serveur</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html671"
  HREF="node19.html">Préparations</A>
 &nbsp; <B>  <A NAME="tex2html679"
  HREF="node1.html">Table des mati&#232;res</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00520000000000000000">
Commencer avec l'installation</A>
</H1>
Connectez le serveur au r&#233;seau et inserez le CD de l'installation de m23 dans le lecteur. Tenez les ajustements de r&#233;seau n&#233;cessaires &#224; main. L'installation s'explique de soi et ne devrait pas poser des probl&#232;mes &#224; quelqu'un qui a des connaissance des concepts fondamentals de l'administration d'un r&#233;seau. Au suivant, vous verrez des copies d'&#233;cran de l'installation, que le serveur va parcourir. Ne vous inqui&#233;tez pas quand il y a encore d'autres affichages sur votre moniteur pendant la procedure de l'installation - je ne le croyais pas utile de d&#233;montrer toutes affichages d'&#233;tat en des copies d'&#233;cran  ;).
<BR>
<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst1.png"
 ALT="Image inst1">
<BR>
Ceci est l'affichage d'amor&#231;age du CD de l'installation de m23. Apr&#232;s que vous ayez appuy&#233; sur la touche Retour, le syst&#232;me d'exploitation Linux amorcera du CD et commencera avec le programme de l'installation.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst2.png"
 ALT="Image inst2">
<BR>
Vous pouvez choisir si vous voulez ex&#233;cuter le programme d'installation en allemand ou en anglais. Ici, nous supposons que vous vous d&#233;ciderez pour l'anglais. 

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst3.png"
 ALT="Image inst3">
<BR>
Un petit <SPAN CLASS="MATH"></SPAN>Bienvenu<SPAN CLASS="MATH"></SPAN>.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst4.png"
 ALT="Image inst4">
<BR>
Entrez le mot de passe de la racine. Root (racine) est l'administrateur du syst&#232;me avec acc&#232;s illimit&#233; au serveur m23. Vous devriez choisir un mot de passe qui ne peut pas &#234;tre devin&#233; facilement et qui consiste au moins de 10 caract&#232;res. Vous devriez aussi employer des caract&#232;res sp&#233;ciaux, des chiffres et des majuscules et des minuscules.
<BR>
Comme le mot de passe n'est pas montr&#233;e, il sera control&#233; par une deuxi&#232;me entr&#233;e dans le dialogue suivant.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst5.png"
 ALT="Image inst5">
<BR>
Le <SPAN CLASS="MATH"></SPAN>hostname<SPAN CLASS="MATH"></SPAN> est le nom pour le serveur.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst6.png"
 ALT="Image inst6">

<BR>
L'adresse IP que vous voulez assigner au serveur. Vous devriez choisir l'adresse d'une fa&#231;on qui rend les clients capable d'atteindre le serveur sans l'emploi d'un routeur.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst7.png"
 ALT="Image inst7">
<BR>
L'adresse du r&#233;seau. C'est l'adresse sous laquelle le r&#233;seau est accessible.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst8.png"
 ALT="Image inst8">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst9.png"
 ALT="Image inst9">

<BR>
Le masque du r&#233;seau indique, quelle partie de l'adresse IP appartient au ordinateur particulier et quelle partie masque le r&#233;seau.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst10.png"
 ALT="Image inst10">

<BR>
L'IP de la passerelle indique l'adresse IP, par laquelle les demandes aux adresses IP sont dirig&#233;es, qui se trouvent hors du r&#233;seau du serveur.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst11.png"
 ALT="Image inst11">

<BR>
Pour la dissolution des noms URL en des adresses IP, il est n&#233;cessaire d'employer un serveur de noms DNS, qui ex&#233;cute la transformation. Par exemple, ftp.debian.org devient 128.101.80.131. Si vous ne connaissez pas de serveur de noms DNS, vous pouvez utiliser l'adresse IP 134.245.10.36. Celle-ci est l'adresse du serveur de noms DNS de l'universit&#233; de Kiel.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst12.png"
 ALT="Image inst12">

<BR>
Ici, vous avez la possibilit&#233; de contr&#244;ler, si vos entr&#233;es sont correctes. Si vous voulez continuer avec l'installation, choisissez <SPAN CLASS="MATH"></SPAN>Yes<SPAN CLASS="MATH"></SPAN>, sinon, vous pouvez corriger vos entr&#233;es apr&#232;s avoir choisi <SPAN CLASS="MATH"></SPAN>No<SPAN CLASS="MATH"></SPAN>.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst13.png"
 ALT="Image inst13">

<BR>
Ici, vous pouvez choisir si vous voulez employer le disque dur tout entier du serveur pour m23. Cela a pour r&#233;sultat que 2 partitions seront &#233;tablies, une pour le syst&#232;me d'exploitation Debian/Linux et une pour la permutation. S'il y a plusieurs disques durs, le premier sera utilis&#233;. Mais vous pouvez aussi utiliser des partitions que vous avez &#233;tablies auparavant si vous souhaitez un partitionnement sp&#233;cial.
<BR>
<BR><SPAN ID="txt115">Information suppl&#233;mentaire concernant le partitionnement</SPAN>
Notez que, pendant l'installation, le serveur sera effac&#233; compl&#232;tement si vous n'avez pas &#233;tabli deux partitions sur le premier disque dur (hda ou sda) avec un programme comme Parted, fdisk, cfdisk etc. comme c'est indiqu&#233; au suivant:

<UL>
<LI>une partition pour m23 d'une taille de 4 GB au moins
</LI>
<LI>une partition pour la permutation pour Linux (recommand&#233; d'une taille deux fois la taille de la m&#233;moire vive)
</LI>
</UL>
Notez les adresses des partitions, s.v.p. Par exemple la premi&#232;re partition du premier disque dur est nomm&#233;e hda1 et la deuxi&#232;me hada2. Si vous utilisez une partition &#233;tendue, la premi&#232;re partition dans la partition &#233;tendue sera nomm&#233;e hda5, la deuxi&#232;me hda6 etc. Vous serez demand&#233; ces adresses pendant l'installation, si vous avez choisi le type <SPAN CLASS="MATH"></SPAN>experte<SPAN CLASS="MATH"></SPAN> pour le partitionnement.
Nous recommandons &#224; la plupart des utilisateurs de sauvegarder les donn&#233;es et de laisser m23 partitionner et formater le serveur entier.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst14.png"
 ALT="Image inst14">

<BR>
Le dernier avertissement ;)

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst15.png"
 ALT="Image inst15">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst16.png"
 ALT="Image inst16">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst17.png"
 ALT="Image inst17">

<BR>
<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst18.png"
 ALT="Image inst18">

<BR>
Ici, vous pouvez d&#233;cider si vous voulez installer le gestionnaire d'amor&#231;age LILO (LInux LOader). Ceci sera install&#233; dans le MBR (MasterBootRecord) du premier disque dur. Si vous vous d&#233;cidez contre, vous devez installer un gestionnaire d'amor&#231;age vous-m&#234;me. Sinon, le serveur m23 ne peut pas amorcer.

<P>
<IMG
  WIDTH="720" HEIGHT="399" ALIGN="BOTTOM" BORDER="0"
 SRC="./inst19.png"
 ALT="Image inst19">

<BR>
L'installation est termin&#233;e ;)

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html680"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html676"
  HREF="node18.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html670"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html678"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> suivant:</B> <A NAME="tex2html681"
  HREF="node21.html">Fin de l'installation</A>
<B> monter:</B> <A NAME="tex2html677"
  HREF="node18.html">Installation du serveur</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html671"
  HREF="node19.html">Préparations</A>
 &nbsp; <B>  <A NAME="tex2html679"
  HREF="node1.html">Table des mati&#232;res</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
dodger
2014-08-06
</ADDRESS>
</BODY>
</HTML>
