<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Renseignement concernant l'architecture du processeur</TITLE>
<META NAME="description" CONTENT="Renseignement concernant l'architecture du processeur">
<META NAME="keywords" CONTENT="manual">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="manual.css">

<LINK REL="previous" HREF="node214.html">
<LINK REL="up" HREF="node211.html">
<LINK REL="next" HREF="node216.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html3296"
  HREF="node216.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html3292"
  HREF="node211.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html3288"
  HREF="node214.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html3294"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> suivant:</B> <A NAME="tex2html3297"
  HREF="node216.html">D&#233;finir le type et</A>
<B> monter:</B> <A NAME="tex2html3293"
  HREF="node211.html">D&#233;finir un poste client</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html3289"
  HREF="node214.html">Information supplémentaire</A>
 &nbsp; <B>  <A NAME="tex2html3295"
  HREF="node1.html">Table des mati&#232;res</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H2><A NAME="SECTION001514000000000000000">
Renseignement concernant l'architecture du processeur</A>
</H2>
m23 est compatible avec les processeurs 32 et 64 bits. Une version 32 bits peut &#234;tre install&#233;e sur un ordinateur 64 bits, l'inverse n'est pas possible. Pour profiter de l'enti&#232;re potentialit&#233; d'un microprocesseur 64 bits, vous devez choisir <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>amd64<SPAN CLASS="MATH"></SPAN></SPAN>. Cette cat&#233;gorie <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>amd64<SPAN CLASS="MATH"></SPAN></SPAN> ne comportent pas uniquement les processeurs AMD, mais &#233;galement ceux d'Intel. Par exemple, les processeurs Intel Pentium D, Pentium Extreme Edition, Celeron D, Core 2 et les processeurs AMD Sempron, Athlon 64, Athlon X2 et Phenom en font partie.
<BR><SPAN  CLASS="textbf">Adresse MAC:</SPAN> Adresse MAC de la carte r&#233;seau du poste client (par ex. 00D0B723865C)
<BR><SPAN  CLASS="textbf">Adresse IP:</SPAN> Adresse IP fixe du poste client (par ex. 192.168.1.23)
<BR><SPAN  CLASS="textbf">Masque r&#233;seau:</SPAN> Masque de sous-r&#233;seau (par ex. 255.255.255.0)
<BR><SPAN  CLASS="textbf">Passerelle:</SPAN> Adresse IP de la passerelle (gateway) pour les connexions au r&#233;seau internet ou &#224; d'autres connexions externes &#224; votre propre r&#233;seau
<BR><SPAN  CLASS="textbf">DNS1:</SPAN> Adresse IP du serveur DNS de r&#233;solution des noms internet
<BR><SPAN  CLASS="textbf">DNS2 (facultatif):</SPAN> Adresse IP du serveur DNS backup
<BR><SPAN  CLASS="textbf">Serveur proxy des paquets:</SPAN> Le poste client essaie de t&#233;l&#233;charger les paquets logiciels sur l'adresse IP du serveur proxy indiqu&#233; dans ce champ. En g&#233;n&#233;ral, il s'agit de l'adresse IP du serveur m23, mais il est &#233;galement possible d'indiquer un autre serveur proxy. Si vous laissez ce champs de saisie vide, le client t&#233;l&#233;chargera les paquets logiciels sur internet. Entrez &#233;galement le num&#233;ro du port du serveur proxy. Dans le cas du serveur m23, c'est le port 2323. Lorsque vous ouvrez la bo&#238;te de dialogue <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Ajouter un client<SPAN CLASS="MATH"></SPAN></SPAN>, le serveur m23 est le serveur proxy par d&#233;faut.
<BR><SPAN  CLASS="textbf">Groupe (facultatif):</SPAN> Nom du groupe de postes client auquel appartient ce poste client
<BR><SPAN  CLASS="textbf">Mot de passe de l&amp;apos;utilisateur:</SPAN> Mot de passe de l'utilisateur employ&#233; &#224; la premi&#232;re connexion au syst&#232;me. Ce mot de passe comporte six chiffres s&#233;lectionn&#233;s au hasard, vous pouvez &#233;galement choisir un mot de passe de votre choix.
<BR><SPAN  CLASS="textbf">Mot de passe du superutilisateur <SPAN CLASS="MATH"></SPAN>root<SPAN CLASS="MATH"></SPAN>:</SPAN> Mot de passe employ&#233; pour l'acc&#232;s au poste client en tant que super-utilisateur (root) . Il comporte huit chiffres s&#233;lectionn&#233;s au hasard, vous pouvez &#233;galement choisir un mot de passe de votre choix.
<BR><SPAN  CLASS="textbf">Fuseau horaire:</SPAN> D&#233;finition du fuseau horaire d'appartenance du poste client.
<BR><SPAN  CLASS="textbf">D&#233;terminer l&amp;apos;heure syst&#232;me par NTP:</SPAN> Option de synchronisation de l'heure du poste client par un serveur de temps NTP accessible sur internet.
<BR><SPAN  CLASS="textbf">Installer les pilotes de l&amp;apos;imprimante puis d&#233;tecter l&amp;apos;imprimante:</SPAN> D&#233;tection puis installation automatique des imprimantes et de leurs pilotes.
<BR><SPAN  CLASS="textbf">Enregistrer les donn&#233;es d&amp;apos;ouverture de session locales sur le poste client.:</SPAN> Cochez cette option si vous d&#233;sirez un compte local sur le poste client pour l'utilisateur.
<BR><SPAN  CLASS="textbf">Ne pas utiliser le LDAP:</SPAN> Pour utiliser uniquement l'authentification locale sur les postes client, cochez <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Ne pas utiliser le LDAP<SPAN CLASS="MATH"></SPAN></SPAN>. 
<BR><SPAN  CLASS="textbf">Lire les donn&#233;es d&amp;apos;ouverture de session depuis le serveur LDAP s&#233;lectionn&#233;.</SPAN>: / Lecture des donn&#233;es d'identification UCS: Pour utiliser les donn&#233;es d'authentification du compte utilisateur enregistr&#233;es sur un serveur LDAP ou sur un serveur UCS, cliquez respectivement sur <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Lire les donn&#233;es d&amp;apos;ouverture de session depuis le serveur LDAP s&#233;lectionn&#233;.<SPAN CLASS="MATH"></SPAN></SPAN> ou <SPAN  CLASS="textit">''Lecture des donn&#233;es d'identification UCS''</SPAN>..
<BR><SPAN  CLASS="textbf">Enregistrer les donn&#233;es d&amp;apos;ouverture de session sur le serveur LDAP. / Sauvegarde des donn&#233;es d'identification sur UCS</SPAN>: Enregistrement des donn&#233;es de l' utilisateur renseign&#233;es ci-dessus, dans la base de donn&#233;es du serveur LDAP m23 ou le serveur UCS, pour l'authentification sur les postes client, cochez <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Enregistrer les donn&#233;es d&amp;apos;ouverture de session sur le serveur LDAP.<SPAN CLASS="MATH"></SPAN></SPAN> ou respectivement <SPAN  CLASS="textit">''Sauvegarde des donn&#233;es d'identification sur UCS''</SPAN>.. Le bon fonctionnement de cette option n&#233;cessite un acc&#232;s complet au serveur LDAP pour l'enregistrement des donn&#233;es sur celui-ci.
<BR><SPAN  CLASS="textbf">ID de l&amp;apos;utilisateur, ID du groupe:</SPAN> De plus, vous devez renseigner l'<SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>ID de l&amp;apos;utilisateur<SPAN CLASS="MATH"></SPAN></SPAN> et l'<SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>ID du groupe<SPAN CLASS="MATH"></SPAN></SPAN> pour le compte utilisateur. Ceci est tr&#232;s important; surtout lors de l'utilisation de NFS pour les r&#233;pertoires personnels.
<BR><SPAN  CLASS="textbf">Nom du serveur LDAP:</SPAN> S&#233;lectionnez un serveur LDAP dans la liste <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Nom du serveur LDAP<SPAN CLASS="MATH"></SPAN></SPAN>. Si le serveur LDAP souhait&#233; n'y apparaissait pas, vous pouvez l'ajouter en cliquant sur <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Administrer le serveur LDAP<SPAN CLASS="MATH"></SPAN></SPAN>. Si m23 a &#233;t&#233; install&#233; sur un serveur UCS, cette derni&#232;re option est invalide. Le service LDAP du serveur UCS sera utilis&#233; &#224; la place.
<BR><SPAN  CLASS="textbf">R&#233;pertoire personnel sur le serveur NFS:</SPAN> Ce champ assure l'enregistrement des donn&#233;es du r&#233;pertoire personnel de l'utilisateur sur un serveur NFS central, afin qu'elles puissent &#234;tre acc&#233;d&#233;es de tout poste client (en combination avec LDAP). Pour activer le NFS, entrez le nom de l'ordinateur ou son adresse IP et le chemin pour l'enregistrement des r&#233;pertoires personnels, comme par exemple: 
<BR><PRE>
192.168.1.23:/nfs-homes
</PRE>
. Si m23 fonctionne sur un serveur UCS, cette derni&#232;re option est invalide.
<BR>
Validez l'ajout du poste client en cliquant sur <SPAN  CLASS="textit"><SPAN CLASS="MATH"></SPAN>Definir<SPAN CLASS="MATH"></SPAN></SPAN>.
<BR>
<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html3296"
  HREF="node216.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html3292"
  HREF="node211.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html3288"
  HREF="node214.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html3294"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> suivant:</B> <A NAME="tex2html3297"
  HREF="node216.html">D&#233;finir le type et</A>
<B> monter:</B> <A NAME="tex2html3293"
  HREF="node211.html">D&#233;finir un poste client</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html3289"
  HREF="node214.html">Information supplémentaire</A>
 &nbsp; <B>  <A NAME="tex2html3295"
  HREF="node1.html">Table des mati&#232;res</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
root
2017-06-22
</ADDRESS>
</BODY>
</HTML>
